_posts/2022-03-14-post-Fundamentals.html
---
title:  Fundamentals continued
categories:
  - blog
tags:
    - basics
---

<p>
Spending some Time on INE, and THM, getting the basics covered, not really mindblowing but defenitly good to strengthen my foundation.
Today checkedout:
</p>
<dl class="org-dl">
<dt>Directory Bruteforcing</dt><dd>With <code>Go/Dirbuster</code> as well as <code>dirb</code></dd>
<dt>XXS</dt><dd>Cros-Site Scripting&#x2026; capturing my first cookies :)</dd>
<dt>RCE</dt><dd>Some basic Remote Code Execution samples</dd>
</dl>
